src/xmlsamples/set_parameter_attributes_1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">API_7bfc27c1f4f0a2c1d775f8aa1840439e</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <cwmp:SetParameterAttributes>
      <ParameterList SOAP-ENC:arrayType="cwmp:SetParameterAttributesStruct[1]">
        <SetParameterAttributesStruct>
          <Name>Device.Test</Name>
          <NotificationChange>0</NotificationChange>
          <Notification>2</Notification>
          <AccessListChange>1</AccessListChange>
          <AccessList>
            <string>Subscriber</string>
          </AccessList>
        </SetParameterAttributesStruct>
      </ParameterList>
    </cwmp:SetParameterAttributes>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>